src/ex_Tabakon/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЧекаККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ВозвратТоваровОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВозвратТоваровОтПокупателя</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ЧекККМ/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТБКВозвратОтПокупателяПосле(Команда) 	
	ЧекККМ = Элементы.Список.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(ЧекККМ) тогда
		НовыйДокументВозврата = ЗаполнитьДокументВозвратТоваровОтПокупателяНаСервере(ЧекККМ);
		
		ПараметрыОткрытия = Новый Структура("Ключ",НовыйДокументВозврата);
		ОткрытьФорму("Документ.ВозвратТоваровОтПокупателя.Форма.ФормаДокумента",ПараметрыОткрытия)
	КонецЕсли; 	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаполнитьДокументВозвратТоваровОтПокупателяНаСервере(ЧекККМ)
	НовыйДокументВозврата = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();

	ЗаполнитьЗначенияСвойств(НовыйДокументВозврата,ЧекККМ);
	
	НовыйДокументВозврата.УстановитьНовыйНомер();
	НовыйДокументВозврата.Дата = ТекущаяДата();
	НовыйДокументВозврата.Склад = ЧекККМ.Магазин.СкладПродажи;
	НовыйДокументВозврата.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(СокрЛП(ЧекККМ.Магазин.Наименование)+" "+"Покупатель");
	
	Для каждого Строка из ЧекККМ.Товары цикл
		НоваяСтрока = НовыйДокументВозврата.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		НоваяСтрока.ДокументПродажи	=	ЧекККМ.ОтчетОРозничныхПродажах;
		НоваяСтрока.ЧекККМ			=	ЧекККМ;
	КонецЦикла;
	
	НовыйДокументВозврата.Записать(РежимЗаписиДокумента.Запись); 	
	Возврат НовыйДокументВозврата.Ссылка;
КонецФункции
